{
  "impressum": {
    "title": "Legal Notice",
    "intro": "This legal notice summarises the required contact information and disclosures for the tutoring practice.",
    "notesTitle": "Key notes",
    "sections": [
      {
        "heading": "Business details",
        "entries": [
          {
            "label": "Name",
            "value": "Teodoro Morcone (Teodoro Morcone Nachhilfe)"
          },
          {
            "label": "Registered address",
            "value": "Eichbühlstrasse 33, 8004 Zurich, Switzerland"
          },
          {
            "label": "Email",
            "value": "info@teodoro.ch",
            "type": "email"
          },
          {
            "label": "Phone / WhatsApp",
            "value": "+41 76 244 02 59",
            "type": "tel"
          },
          {
            "label": "Website",
            "value": "teodoro.ch",
            "type": "url"
          }
        ]
      },
      {
        "heading": "Tutoring services",
        "entries": [
          {
            "label": "Lesson format",
            "value": "Lessons are delivered exclusively online via Zoom. The exact tool and settings are agreed during booking."
          },
          {
            "label": "Security",
            "value": "Zoom rooms are secured with waiting room and passcode."
          }
        ]
      },
      {
        "heading": "VAT status",
        "entries": [
          {
            "label": "Swiss VAT",
            "value": "Annual revenue < CHF 100,000 → not VAT-registered."
          }
        ]
      },
      {
        "heading": "Liability & external links",
        "entries": [
          {
            "label": "Content responsibility",
            "value": "Content is reviewed with care; however, no liability is assumed for completeness, accuracy, or currency."
          },
          {
            "label": "External links",
            "value": "External links are beyond our control."
          }
        ]
      }
    ],
    "notes": [
      "Tutoring contracts are governed by Swiss law.",
      "Mandatory venues remain reserved. For consumer claims, the competent court is at the consumer’s domicile or at the provider’s registered office; otherwise, Zurich applies."
    ]
  },
  "privacy": {
    "title": "Privacy Policy",
    "lastUpdated": "Updated: November 2025",
    "intro": "The sections below explain how I handle personal data for Swiss-based tutoring services, covering data sources, retention, third-party processors, and your rights.",
    "sections": [
      {
        "id": "dataCollection",
        "heading": "Data Collection & Sources",
        "body": [
          "I operate exclusively in Switzerland and process personal data to deliver one-on-one tutoring in accordance with the Federal Act on Data Protection (FADP) and the guidance of the Federal Data Protection and Information Commissioner (FDPIC). I collect information directly from you when you submit a contact request, schedule through Calendesk, join a Zoom lesson, or communicate by email or chat.",
          "This may include contact details, lesson goals, preferred availability, payment references, and manually written preparation notes that help me customise each session. My privately managed Swiss server generates truncated IP addresses, user-agent details, and security logs needed to ensure availability and protect against misuse. Consent decisions are recorded so I can demonstrate compliance. Optional analytics data reaches Google Analytics 4 only after you explicitly opt in via the cookie banner, and those records remain pseudonymised. I do not carry out automated decision-making or profiling—every booking confirmation, lesson plan, and pricing decision is handled personally by me."
        ]
      },
      {
        "id": "retention",
        "heading": "Retention & Deletion",
        "list": [
          "Inquiry emails or chat threads that do not result in lessons are deleted after 12 months.",
          "Active learner profiles, lesson notes, and supporting materials are retained for up to three years after the final session unless you request earlier deletion and no statutory duty requires longer storage.",
          "Accounting records, invoices, and payment receipts are kept for 10 years to comply with Swiss commercial obligations.",
          "Cookie and marketing consent logs are stored for five years to evidence adherence to FDPIC guidance.",
          "Security logs on my Swiss server are rotated after 12 months; optional Google Analytics 4 data is configured to expire automatically after 14 months.",
          "When you ask for deletion at info@teodoro.ch, I erase the relevant data within 30 days once legal obligations end, and I remove associated backups during the next maintenance cycle."
        ]
      },
      {
        "id": "thirdParties",
        "heading": "Third-Party Services & Transfers",
        "list": [
          "**Swiss private hosting:** I run the website on infrastructure located in Switzerland under my exclusive control, so core hosting involves no cross-border transfers.",
          "**Calendesk (Poland, EU):** Handles scheduling, reminders, and payment status within EU data centres. Transfers rely on the FDPIC-recognised adequacy decision for the European Economic Area, and only I and bound support staff can access the data.",
          "**Zoom (EU data residency, provider headquartered in the USA):** Videoconferencing uses waiting rooms, passcodes, and end-to-end encryption. Recordings are disabled by default; if a recording becomes necessary, I obtain written consent and delete it within 30 days unless a legal retention duty applies. Standard Contractual Clauses (SCCs) acknowledged by the FDPIC, plus strict configuration controls, protect any cross-border access.",
          "**Google Workspace & Google Analytics (EU/USA):** Email, document collaboration, and optional statistics rely on SCCs, encryption in transit and at rest, IP truncation, and the exclusion of advertising features. I disclose only the minimum data required to operate these services.",
          "I do not sell personal data and I share it only with these processors or when Swiss law requires disclosure."
        ]
      },
      {
        "id": "rights",
        "heading": "How to Exercise Your Rights",
        "body": [
          "For access, rectification, portability, deletion, or consent withdrawal, email info@teodoro.ch or write to Teodoro Morcone Nachhilfe, Eichbühlstrasse 33, 8004 Zürich. I verify identity with proportionate steps (for example, a reply from the registered email address) and respond within 30 days; complex requests may extend by up to another 30 days, with advance notice. You can adjust analytics preferences anytime through the “Cookie settings” link in the footer.",
          "If you consider my response unsatisfactory, you may contact the Federal Data Protection and Information Commissioner (FDPIC), Feldeggweg 1, 3003 Bern. Exercising your rights is free of charge unless a request is manifestly unfounded or excessive."
        ]
      }
    ],
    "rights": {
      "title": "Contact for privacy requests",
      "email": "info@teodoro.ch",
      "reference": "Federal Data Protection and Information Commissioner (FDPIC), Feldeggweg 1, 3003 Bern"
    },
    "cookieLink": "Cookie management",
    "cookieTable": {
      "title": "List of cookies and similar technologies",
      "caption": "These tables describe the cookies and technologies used on teodoro.ch, grouped by purpose.",
      "columns": {
        "name": "Name",
        "provider": "Provider",
        "purpose": "Purpose",
        "lifetime": "Lifetime"
      },
      "categories": {
        "essential": "Essential cookies",
        "analytics": "Analytics (GA4)",
        "marketing": "Marketing (Meta Pixel)"
      }
    }
  },
  "cancellation": {
    "title": "Cancellations & no-shows",
    "body": [
      "Sessions may be cancelled or rescheduled free of charge up to 24 hours in advance.",
      "Late cancellations or no-shows are billed as one full lesson.",
      "Payment is collected upfront via Stripe payment link (card, Twint); receipts are emailed automatically."
    ]
  },
  "minors": {
    "title": "Guidance for minors",
    "body": [
      "Consent from parents or guardians is required for learners under 16.",
      "Communication is coordinated with parents/guardians whenever possible.",
      "Zoom recordings take place only with explicit written approval."
    ]
  },
  "cookieSettings": {
    "title": "Cookie settings",
    "description": "Adjust your preferences. Essential cookies are required; analytics and marketing run only with your consent.",
    "categories": [
      {
        "id": "essential",
        "label": "Essential cookies",
        "description": "Needed for core functionality such as forms and security.",
        "cookies": ["session", "consent-state"]
      },
      {
        "id": "analytics",
        "label": "Analytics (GA4)",
        "description": "Anonymous analytics with Google Analytics 4, loaded only after consent.",
        "cookies": ["_ga*"]
      }
    ],
    "actions": {
      "save": "Save preferences",
      "cancel": "Cancel"
    }
  }
}