{
  "impressum": {
    "title": "Impressum",
    "intro": "Questo impressum riassume le informazioni obbligatorie per l’attività di ripetizioni.",
    "notesTitle": "Note importanti",
    "sections": [
      {
        "heading": "Dati dell’attività",
        "entries": [
          {
            "label": "Nome",
            "value": "Teodoro Morcone (Teodoro Morcone Nachhilfe)"
          },
          {
            "label": "Sede legale",
            "value": "Eichbühlstrasse 33, 8004 Zurigo, Svizzera"
          },
          {
            "label": "E-mail",
            "value": "info@teodoro.ch",
            "type": "email"
          },
          {
            "label": "Telefono / WhatsApp",
            "value": "+41 76 244 02 59",
            "type": "tel"
          },
          {
            "label": "Sito web",
            "value": "teodoro.ch",
            "type": "url"
          }
        ]
      },
      {
        "heading": "Servizi didattici",
        "entries": [
          {
            "label": "Formato delle lezioni",
            "value": "Le lezioni si svolgono esclusivamente online via Zoom."
          },
          {
            "label": "Sicurezza",
            "value": "Le stanze Zoom sono protette da sala d’attesa e passcode."
          }
        ]
      },
      {
        "heading": "IVA",
        "entries": [
          {
            "label": "IVA svizzera",
            "value": "Fatturato < CHF 100’000/anno → attività non soggetta a IVA."
          }
        ]
      },
      {
        "heading": "Responsabilità & link",
        "entries": [
          {
            "label": "Contenuti",
            "value": "Tutti i contenuti sono stati verificati con cura, ma non si garantisce completezza, correttezza o aggiornamento."
          },
          {
            "label": "Link esterni",
            "value": "I link a siti esterni sono al di fuori della nostra responsabilità."
          }
        ]
      }
    ],
    "notes": [
      "I contratti di ripetizione sono disciplinati dal diritto svizzero.",
      "I fori obbligatori rimangono riservati. Per le azioni delle/dei consumatrici/consumatori è competente il tribunale del loro domicilio oppure la sede del fornitore; per il resto è competente Zurigo."
    ]
  },
  "privacy": {
    "title": "Informativa sulla privacy",
    "lastUpdated": "Aggiornato: novembre 2025",
    "intro": "Le sezioni seguenti illustrano come tratto i dati personali per il servizio di tutoraggio basato in Svizzera, incluse le fonti dei dati, le tempistiche di conservazione, i fornitori terzi coinvolti e i tuoi diritti.",
    "sections": [
      {
        "id": "dataCollection",
        "heading": "Raccolta dei dati & Fonti",
        "body": [
          "Gestisco il servizio di tutoraggio esclusivamente dalla Svizzera e tratto i dati personali solo per adempiere ai contratti, in conformità alla Legge federale sulla protezione dei dati (LPD) e alle raccomandazioni dell’Incaricato federale della protezione dei dati e della trasparenza (IFPDT). Raccolgo le informazioni direttamente da te quando invii una richiesta, prenoti tramite Calendesk, partecipi a una sessione Zoom o comunichi via e-mail/chat.",
          "Ciò include recapiti, obiettivi didattici, disponibilità, riferimenti di pagamento e appunti manuali che mi aiutano a preparare la lezione. Il mio server privato situato in Svizzera genera automaticamente indirizzi IP troncati, dati del browser e log di sicurezza per proteggere il servizio. Registro le scelte di consenso per dimostrare la conformità alle linee guida dell’IFPDT. Gli eventi analitici raggiungono Google Analytics 4 solo dopo il tuo consenso esplicito e restano pseudonimizzati. Non applico decisioni automatizzate né profilazione: ogni conferma, ogni piano di lezione e ogni decisione sui prezzi è presa personalmente da me."
        ]
      },
      {
        "id": "retention",
        "heading": "Conservazione & Cancellazione",
        "list": [
          "Le richieste che non portano a lezioni vengono eliminate dopo 12 mesi.",
          "Profili attivi, appunti di lezione e materiali di supporto restano archiviati fino a tre anni dall’ultima sessione, salvo tua richiesta di cancellazione anticipata e assenza di obblighi legali.",
          "Documentazione contabile, fatture e ricevute devono essere conservate per 10 anni secondo la normativa commerciale svizzera.",
          "I registri di consenso e delle preferenze cookie sono mantenuti per cinque anni per attestare la conformità alle raccomandazioni IFPDT.",
          "I log di sicurezza sul mio server svizzero vengono eliminati dopo 12 mesi; i dati facoltativi di Google Analytics 4 sono impostati per la cancellazione automatica dopo 14 mesi.",
          "Quando ricevo una richiesta di cancellazione a info@teodoro.ch, elimino i dati entro 30 giorni, una volta conclusi gli obblighi legali, e rimuovo le copie di backup nel successivo ciclo di manutenzione."
        ]
      },
      {
        "id": "thirdParties",
        "heading": "Servizi terzi & Trasferimenti",
        "list": [
          "**Hosting privato svizzero:** Il sito è ospitato su infrastruttura di mia proprietà situata in Svizzera, quindi l’hosting principale non comporta trasferimenti transfrontalieri.",
          "**Calendesk (Polonia/UE):** Gestisce pianificazioni, promemoria e stato dei pagamenti in data center europei. Il trasferimento dalla Svizzera verso l’UE si basa sulla decisione di adeguatezza riconosciuta dall’IFPDT; l’accesso è limitato a me e al supporto vincolato da obblighi di riservatezza.",
          "**Zoom (residenza dati UE, fornitore con sede negli USA):** Le lezioni si svolgono con sala d’attesa, passcode e crittografia. Le registrazioni sono disattivate per impostazione predefinita; se necessarie, chiedo il consenso scritto e le elimino entro 30 giorni, salvo obblighi legali. Le Clausole contrattuali standard (SCC) riconosciute dall’IFPDT e ulteriori controlli tecnici tutelano eventuali trasferimenti verso gli USA.",
          "**Google Workspace & Google Analytics (UE/USA):** Posta elettronica, collaborazione documentale e statistiche opzionali si avvalgono delle SCC, della cifratura e dell’anonimizzazione degli IP; le funzioni pubblicitarie sono disattivate e comunico solo i dati indispensabili.",
          "Non vendo i dati personali e li condivido solo con questi responsabili del trattamento o quando la legge svizzera lo impone."
        ]
      },
      {
        "id": "rights",
        "heading": "Come esercitare i tuoi diritti",
        "body": [
          "Per richiedere accesso, rettifica, portabilità, cancellazione o revocare il consenso, scrivimi a info@teodoro.ch oppure a Teodoro Morcone Nachhilfe, Eichbühlstrasse 33, 8004 Zurigo. Verifico l’identità con misure proporzionate (ad esempio una risposta dall’indirizzo registrato) e rispondo entro 30 giorni; se la richiesta è complessa, posso prorogare di ulteriori 30 giorni informandoti in anticipo. Puoi modificare le preferenze sui cookie in qualsiasi momento tramite il link “Impostazioni cookie” nel footer.",
          "Se ritieni che la risposta non sia conforme, puoi rivolgerti all’Incaricato federale della protezione dei dati e della trasparenza (IFPDT), Feldeggweg 1, 3003 Berna. L’esercizio dei diritti è gratuito, salvo richieste manifestamente infondate o eccessive."
        ]
      }
    ],
    "rights": {
      "title": "Contatti per richieste privacy",
      "email": "info@teodoro.ch",
      "reference": "Incaricato federale della protezione dei dati e della trasparenza (IFPDT), Feldeggweg 1, 3003 Berna"
    },
    "cookieLink": "Gestione cookie",
    "cookieTable": {
      "title": "Elenco di cookie e tecnologie analoghe",
      "caption": "Queste tabelle descrivono i cookie e le tecnologie usati su teodoro.ch, raggruppati per finalità.",
      "columns": {
        "name": "Nome",
        "provider": "Fornitore",
        "purpose": "Finalità",
        "lifetime": "Durata"
      },
      "categories": {
        "essential": "Cookie essenziali",
        "analytics": "Statistica (GA4)",
        "marketing": "Marketing (Meta Pixel)"
      }
    }
  },
  "cancellation": {
    "title": "Cancellazioni & assenze",
    "body": [
      "Le sessioni possono essere annullate o spostate gratuitamente fino a 24 ore prima.",
      "Per cancellazioni tardive o assenze senza preavviso viene addebitata la lezione.",
      "Pagamento tramite fattura o bonifico entro 10 giorni."
    ]
  },
  "minors": {
    "title": "Indicazioni per minorenni",
    "body": [
      "È necessaria l’approvazione dei genitori/tutori per studenti sotto i 16 anni.",
      "Le comunicazioni avvengono preferibilmente con o insieme ai genitori.",
      "In Zoom non vengono usati nomi completi dei minorenni senza consenso."
    ]
  },
  "cookieSettings": {
    "title": "Impostazioni cookie",
    "description": "Personalizza le preferenze. I cookie essenziali sono obbligatori; statistica e marketing richiedono il tuo consenso.",
    "categories": [
      {
        "id": "essential",
        "label": "Essenziali",
        "description": "Necessari per funzioni di base come form e sicurezza.",
        "cookies": ["session", "consent-state"]
      },
      {
        "id": "analytics",
        "label": "Statistica (GA4)",
        "description": "Analisi anonima con Google Analytics 4. Attivata solo dopo consenso.",
        "cookies": ["_ga*"]
      }
    ],
    "actions": {
      "save": "Salva preferenze",
      "cancel": "Annulla"
    }
  }
}